controllers/DonasiController.php

SELECT * FROM `donasi` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Donasi::findOne($id)) !== null) {