controllers/DonaturController.php

    protected function findModel($id)
    {
        if (($model = Donatur::findOne($id)) !== null) {
---
SELECT * FROM `donatur` WHERE `id`='1'