controllers/SiswaController.php

    public function actionCreate()
    {
        $model = new Siswa();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `siswa` (`nama`, `alamat`, `tgl_lahir`, `foto`, `jenjang_id`) VALUES ('Husna', 'Bekasi', '12/31/1999', '', 4)

    protected function findModel($id)
    {
        if (($model = Siswa::findOne($id)) !== null) {
---
SELECT * FROM `siswa` WHERE `id`='2'