views/siswa/_form.php


<div class="siswa-form">
    <?php
    $data_jenjang = ArrayHelper::map(JenjangPendidikan::find()->asArray()->all(),'id','nama');
---
SELECT * FROM `jenjang_pendidikan`