views/donasi/_form.php


<div class="donasi-form">
    <?php
    $data_jenis = ArrayHelper::map(Jenis::find()->asArray()->all(),'id','nama');
---
SELECT * FROM `jenis`