models/User.php

SELECT * FROM `donatur` WHERE `id`=1
---
    public static function findIdentity($id)
    {
        //mencari user login berdasarkan IDnya dan hanya dicari 1.
        $user = Donatur::findOne($id);

SELECT * FROM `donatur` WHERE `username`='ardith24'
---
    public static function findByUsername($username)
    {
        //mencari user login berdasarkan username dan hanya dicari 1.
        $user = Donatur::find()->where(['username'=>$username])->one();